# JupyterLite `xeus-sqlite` Kernel Demo

The [`jupyterlite/xeus-sqlite-kernel`](https://github.com/jupyterlite/xeus-sqlite-kernel) wraps the original [`jupyter-xeus/xeus-sqlite`](https://github.com/jupyter-xeus/xeus-sqlite/) kernel for use in JupyterLite.

Original kernel docs can be found [here](https://xeus-sqlite.readthedocs.io/en/latest/).

The kernel provides cell magic for command line database operations, and native execution of SQL code against a connected database.

[Title](../xeus-sqlite/simple-operations.ipynb)

## Creating a Database

Line magic is used to create an in-memory database:

In [1]:
%CREATE example_db.db

Currently, there is no ability to:

- save the database to browser storage;
- export the database;
- load a database from browser storage;
- load a database from a URL;
- load a database from the desktop;
- connect to a remote sqlite database file.

## Create and Populate Tables

Tables are created and populated using SQL:

In [2]:
CREATE TABLE employees (
	employee_id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
	first_name text,
	last_name text NOT NULL,
	email text NOT NULL,
	phone_number text,
	hire_date text NOT NULL,
	job_id INTEGER NOT NULL,
	salary double NOT NULL,
	manager_id INTEGER,
	department_id INTEGER NOT NULL,
	FOREIGN KEY (job_id) REFERENCES jobs (job_id) ON DELETE CASCADE ON UPDATE CASCADE,
	FOREIGN KEY (department_id) REFERENCES departments (department_id) ON DELETE CASCADE ON UPDATE CASCADE,
	FOREIGN KEY (manager_id) REFERENCES employees (employee_id) ON DELETE CASCADE ON UPDATE CASCADE
);

In [3]:
CREATE TABLE departments (
	department_id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
	department_name text NOT NULL,
	location_id INTEGER NOT NULL,
	FOREIGN KEY (location_id) REFERENCES locations (location_id) ON DELETE CASCADE ON UPDATE CASCADE
);

In [4]:

CREATE TABLE jobs (
	job_id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
	job_title text NOT NULL,
	min_salary double NOT NULL,
	max_salary double NOT NULL
);

Only one command can be executed from within a single code cell:

In [5]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (1,'Public Accountant',4200.00,9000.00);

In [6]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (2,'Accounting Manager',8200.00,16000.00);

In [7]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (3,'Administration Assistant',3000.00,6000.00);

In [8]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (4,'President',20000.00,40000.00);

In [9]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (5,'Administration Vice President',15000.00,30000.00);

In [10]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (6,'Accountant',4200.00,9000.00);

In [11]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (7,'Finance Manager',8200.00,16000.00);

In [12]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (8,'Human Resources Representative',4000.00,9000.00);

In [13]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (9,'Programmer',4000.00,10000.00);

In [14]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (10,'Marketing Manager',9000.00,15000.00);

In [15]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (11,'Marketing Representative',4000.00,9000.00);

In [16]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (12,'Public Relations Representative',4500.00,10500.00);

In [17]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (13,'Purchasing Clerk',2500.00,5500.00);

In [18]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (14,'Purchasing Manager',8000.00,15000.00);

In [19]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (15,'Sales Manager',10000.00,20000.00);

In [20]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (16,'Sales Representative',6000.00,12000.00);

In [21]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (17,'Shipping Clerk',2500.00,5500.00);

In [22]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (18,'Stock Clerk',2000.00,5000.00);

In [23]:
INSERT INTO jobs(job_id,job_title,min_salary,max_salary) VALUES (19,'Stock Manager',5500.00,8500.00);

In [24]:

/*Data for the table departments */

INSERT INTO departments(department_id,department_name,location_id) VALUES (1,'Administration',1700);

In [25]:
INSERT INTO departments(department_id,department_name,location_id) VALUES (2,'Marketing',1800);

In [26]:
INSERT INTO departments(department_id,department_name,location_id) VALUES (3,'Purchasing',1700);

In [27]:
INSERT INTO departments(department_id,department_name,location_id) VALUES (4,'Human Resources',2400);

In [28]:
INSERT INTO departments(department_id,department_name,location_id) VALUES (5,'Shipping',1500);

In [29]:
INSERT INTO departments(department_id,department_name,location_id) VALUES (6,'IT',1400);

In [30]:
INSERT INTO departments(department_id,department_name,location_id) VALUES (7,'Public Relations',2700);

In [31]:
INSERT INTO departments(department_id,department_name,location_id) VALUES (8,'Sales',2500);

In [32]:
INSERT INTO departments(department_id,department_name,location_id) VALUES (9,'Executive',1700);

In [33]:
INSERT INTO departments(department_id,department_name,location_id) VALUES (10,'Finance',1700);

In [34]:
INSERT INTO departments(department_id,department_name,location_id) VALUES (11,'Accounting',1700);

In [35]:
/*Data for the table employees */

INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (100,'Steven','King','steven.king@sqltutorial.org','515.123.4567','1987-06-17',4,24000.00,NULL,9);

In [36]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (101,'Neena','Kochhar','neena.kochhar@sqltutorial.org','515.123.4568','1989-09-21',5,17000.00,100,9);

In [37]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (102,'Lex','De Haan','lex.de haan@sqltutorial.org','515.123.4569','1993-01-13',5,17000.00,100,9);

In [38]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (103,'Alexander','Hunold','alexander.hunold@sqltutorial.org','590.423.4567','1990-01-03',9,9000.00,102,6);

In [39]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (104,'Bruce','Ernst','bruce.ernst@sqltutorial.org','590.423.4568','1991-05-21',9,6000.00,103,6);

In [40]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (105,'David','Austin','david.austin@sqltutorial.org','590.423.4569','1997-06-25',9,4800.00,103,6);

In [41]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (106,'Valli','Pataballa','valli.pataballa@sqltutorial.org','590.423.4560','1998-02-05',9,4800.00,103,6);

In [42]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (107,'Diana','Lorentz','diana.lorentz@sqltutorial.org','590.423.5567','1999-02-07',9,4200.00,103,6);

In [43]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (108,'Nancy','Greenberg','nancy.greenberg@sqltutorial.org','515.124.4569','1994-08-17',7,12000.00,101,10);

In [44]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (109,'Daniel','Faviet','daniel.faviet@sqltutorial.org','515.124.4169','1994-08-16',6,9000.00,108,10);

In [45]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (110,'John','Chen','john.chen@sqltutorial.org','515.124.4269','1997-09-28',6,8200.00,108,10);

In [46]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (111,'Ismael','Sciarra','ismael.sciarra@sqltutorial.org','515.124.4369','1997-09-30',6,7700.00,108,10);

In [47]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (112,'Jose Manuel','Urman','jose manuel.urman@sqltutorial.org','515.124.4469','1998-03-07',6,7800.00,108,10);

In [48]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (113,'Luis','Popp','luis.popp@sqltutorial.org','515.124.4567','1999-12-07',6,6900.00,108,10);

In [49]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (114,'Den','Raphaely','den.raphaely@sqltutorial.org','515.127.4561','1994-12-07',14,11000.00,100,3);

In [50]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (115,'Alexander','Khoo','alexander.khoo@sqltutorial.org','515.127.4562','1995-05-18',13,3100.00,114,3);

In [51]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (116,'Shelli','Baida','shelli.baida@sqltutorial.org','515.127.4563','1997-12-24',13,2900.00,114,3);

In [52]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (117,'Sigal','Tobias','sigal.tobias@sqltutorial.org','515.127.4564','1997-07-24',13,2800.00,114,3);

In [53]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (118,'Guy','Himuro','guy.himuro@sqltutorial.org','515.127.4565','1998-11-15',13,2600.00,114,3);

In [54]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (119,'Karen','Colmenares','karen.colmenares@sqltutorial.org','515.127.4566','1999-08-10',13,2500.00,114,3);

In [55]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (120,'Matthew','Weiss','matthew.weiss@sqltutorial.org','650.123.1234','1996-07-18',19,8000.00,100,5);

In [56]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (121,'Adam','Fripp','adam.fripp@sqltutorial.org','650.123.2234','1997-04-10',19,8200.00,100,5);

In [57]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (122,'Payam','Kaufling','payam.kaufling@sqltutorial.org','650.123.3234','1995-05-01',19,7900.00,100,5);

In [58]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (123,'Shanta','Vollman','shanta.vollman@sqltutorial.org','650.123.4234','1997-10-10',19,6500.00,100,5);

In [59]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (126,'Irene','Mikkilineni','irene.mikkilineni@sqltutorial.org','650.124.1224','1998-09-28',18,2700.00,120,5);

In [60]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (145,'John','Russell','john.russell@sqltutorial.org',NULL,'1996-10-01',15,14000.00,100,8);

In [61]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (146,'Karen','Partners','karen.partners@sqltutorial.org',NULL,'1997-01-05',15,13500.00,100,8);

In [62]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (176,'Jonathon','Taylor','jonathon.taylor@sqltutorial.org',NULL,'1998-03-24',16,8600.00,100,8);

In [63]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (177,'Jack','Livingston','jack.livingston@sqltutorial.org',NULL,'1998-04-23',16,8400.00,100,8);

In [64]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (178,'Kimberely','Grant','kimberely.grant@sqltutorial.org',NULL,'1999-05-24',16,7000.00,100,8);

In [65]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (179,'Charles','Johnson','charles.johnson@sqltutorial.org',NULL,'2000-01-04',16,6200.00,100,8);

In [66]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (192,'Sarah','Bell','sarah.bell@sqltutorial.org','650.501.1876','1996-02-04',17,4000.00,123,5);

In [67]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (193,'Britney','Everett','britney.everett@sqltutorial.org','650.501.2876','1997-03-03',17,3900.00,123,5);

In [68]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (200,'Jennifer','Whalen','jennifer.whalen@sqltutorial.org','515.123.4444','1987-09-17',3,4400.00,101,1);

In [69]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (201,'Michael','Hartstein','michael.hartstein@sqltutorial.org','515.123.5555','1996-02-17',10,13000.00,100,2);

In [70]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (202,'Pat','Fay','pat.fay@sqltutorial.org','603.123.6666','1997-08-17',11,6000.00,201,2);

In [71]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (203,'Susan','Mavris','susan.mavris@sqltutorial.org','515.123.7777','1994-06-07',8,6500.00,101,4);

In [72]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (204,'Hermann','Baer','hermann.baer@sqltutorial.org','515.123.8888','1994-06-07',12,10000.00,101,7);

In [73]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (205,'Shelley','Higgins','shelley.higgins@sqltutorial.org','515.123.8080','1994-06-07',2,12000.00,101,11);

In [74]:
INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id) VALUES (206,'William','Gietz','william.gietz@sqltutorial.org','515.123.8181','1994-06-07',1,8300.00,205,11);

In [75]:
SELECT employee_id, first_name, last_name, email FROM employees LIMIT 10;

+-------------+------------+-----------+----------------------------------+
| employee_id | first_name | last_name | email                            |
+-------------+------------+-----------+----------------------------------+
| 100         | Steven     | King      | steven.king@sqltutorial.org      |
+-------------+------------+-----------+----------------------------------+
| 101         | Neena      | Kochhar   | neena.kochhar@sqltutorial.org    |
+-------------+------------+-----------+----------------------------------+
| 102         | Lex        | De Haan   | lex.de haan@sqltutorial.org      |
+-------------+------------+-----------+----------------------------------+
| 103         | Alexander  | Hunold    | alexander.hunold@sqltutorial.org |
+-------------+------------+-----------+----------------------------------+
| 104         | Bruce      | Ernst     | bruce.ernst@sqltutorial.org      |
+-------------+------------+-----------+----------------------------------+
| 105         | David      | Austin    | david.austin@sqltutorial.org     |
+-------------+------------+-----------+----------------------------------+
| 106         | Valli      | Pataballa | valli.pataballa@sqltutorial.org  |
+-------------+------------+-----------+----------------------------------+
| 107         | Diana      | Lorentz   | diana.lorentz@sqltutorial.org    |
+-------------+------------+-----------+----------------------------------+
| 108         | Nancy      | Greenberg | nancy.greenberg@sqltutorial.org  |
+-------------+------------+-----------+----------------------------------+
| 109         | Daniel     | Faviet    | daniel.faviet@sqltutorial.org    |
+-------------+------------+-----------+----------------------------------+

In [76]:
SELECT employee_id, first_name, last_name, email, job_title, department_name FROM employees JOIN jobs ON employees.job_id=jobs.job_id JOIN departments ON employees.department_id = departments.department_id LIMIT 10;

+-------------+------------+-----------+----------------------------------+-------------------------------+-----------------+
| employee_id | first_name | last_name | email                            | job_title                     | department_name |
+-------------+------------+-----------+----------------------------------+-------------------------------+-----------------+
| 100         | Steven     | King      | steven.king@sqltutorial.org      | President                     | Executive       |
+-------------+------------+-----------+----------------------------------+-------------------------------+-----------------+
| 101         | Neena      | Kochhar   | neena.kochhar@sqltutorial.org    | Administration Vice President | Executive       |
+-------------+------------+-----------+----------------------------------+-------------------------------+-----------------+
| 102         | Lex        | De Haan   | lex.de haan@sqltutorial.org      | Administration Vice President | Executive       |
+-------------+------------+-----------+----------------------------------+-------------------------------+-----------------+
| 103         | Alexander  | Hunold    | alexander.hunold@sqltutorial.org | Programmer                    | IT              |
+-------------+------------+-----------+----------------------------------+-------------------------------+-----------------+
| 104         | Bruce      | Ernst     | bruce.ernst@sqltutorial.org      | Programmer                    | IT              |
+-------------+------------+-----------+----------------------------------+-------------------------------+-----------------+
| 105         | David      | Austin    | david.austin@sqltutorial.org     | Programmer                    | IT              |
+-------------+------------+-----------+----------------------------------+-------------------------------+-----------------+
| 106         | Valli      | Pataballa | valli.pataballa@sqltutorial.org  | Programmer                    | IT              |
+-------------+------------+-----------+----------------------------------+-------------------------------+-----------------+
| 107         | Diana      | Lorentz   | diana.lorentz@sqltutorial.org    | Programmer                    | IT              |
+-------------+------------+-----------+----------------------------------+-------------------------------+-----------------+
| 108         | Nancy      | Greenberg | nancy.greenberg@sqltutorial.org  | Finance Manager               | Finance         |
+-------------+------------+-----------+----------------------------------+-------------------------------+-----------------+
| 109         | Daniel     | Faviet    | daniel.faviet@sqltutorial.org    | Accountant                    | Finance         |
+-------------+------------+-----------+----------------------------------+-------------------------------+-----------------+

In [77]:
SELECT employee_id, first_name, last_name, email, job_title, department_name FROM employees JOIN jobs ON employees.job_id=jobs.job_id JOIN departments ON employees.department_id = departments.department_id WHERE job_title="Sales Manager";

+-------------+------------+-----------+--------------------------------+---------------+-----------------+
| employee_id | first_name | last_name | email                          | job_title     | department_name |
+-------------+------------+-----------+--------------------------------+---------------+-----------------+
| 145         | John       | Russell   | john.russell@sqltutorial.org   | Sales Manager | Sales           |
+-------------+------------+-----------+--------------------------------+---------------+-----------------+
| 146         | Karen      | Partners  | karen.partners@sqltutorial.org | Sales Manager | Sales           |
+-------------+------------+-----------+--------------------------------+---------------+-----------------+